#include "def.h"
#include "en29lv040.h"

///***********************************************************************************
//	Rom Wr 초기화
//************************************************************************************
void en29_Init()
{
}

//************************************************************************************
//	Rom 전부 지우기 : EN29F040
//************************************************************************************
void en29_AllErase()
{
	UCHAR *pAddr = (UCHAR *)EN29LV040_BASE;	
	pAddr[0x555] = 0xaa;
	pAddr[0x2aa] = 0x55;
	pAddr[0x555] = 0x80;
	pAddr[0x555] = 0xaa;
	pAddr[0x2aa] = 0x55;
	pAddr[0x555] = 0x10;

	while(WORD_L(pAddr[0x00000]) != 0xff);
}

//************************************************************************************
//	Rom Sector지우기 : EN29F040
//	지울때 64KByte씩 지워짐
//************************************************************************************
void en29_SectorErase(UINT nAddr)
{
	UCHAR *pAddr = (UCHAR *)EN29LV040_BASE;	
	pAddr[0x555] = 0xaa;
	pAddr[0x2aa] = 0x55;
	pAddr[0x555] = 0x80;
	pAddr[0x555] = 0xaa;
	pAddr[0x2aa] = 0x55;
	pAddr[nAddr] = 0x30;
	
	while(WORD_L(pAddr[nAddr]) != 0xff);
}

//************************************************************************************
//	Rom에 한바이트씩 쓰기
//************************************************************************************
void en29_WriteByte(UINT nAddr,UCHAR nDat)
{
	UCHAR *pAddr = (UCHAR *)EN29LV040_BASE;
	pAddr[0x555] = 0xaa;
	pAddr[0x2aa] = 0x55;	
	pAddr[0x555] = 0xa0;
	pAddr[nAddr] = nDat;
			
	while(WORD_L(pAddr[nAddr]) != nDat);
}			

//************************************************************************************
//	Rom에 한바이트씩 읽기
//************************************************************************************
UCHAR en29_ReadByte(UINT nAddr)
{
	UCHAR *pAddr = (UCHAR *)EN29LV040_BASE;
	return WORD_L(pAddr[nAddr]);
}			

